docs/java/jcf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Java Collections Framework</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />

<link rel="stylesheet" type="text/css" href="../assets/style.min.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Java Collections Framework</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org767ebd6">1. Slides</a></li>
<li><a href="#orgf5a40e6">2. References</a></li>
</ul>
</div>
</div>
<p>
The Java platform includes a collections framework. A collection is an object that represents a group of objects (such as the classic Vector class). A collections framework is a unified architecture for representing and manipulating collections, enabling collections to be manipulated independently of implementation details.
</p>

<p>
The available implementations are described in the <a href="https://docs.oracle.com/javase/8/docs/technotes/guides/collections/overview.html">Java Documentation</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Interface</th>
<th scope="col" class="org-left">HashTable</th>
<th scope="col" class="org-left">Resizable Array</th>
<th scope="col" class="org-left">Balanced Tree</th>
<th scope="col" class="org-left">Linked List</th>
<th scope="col" class="org-left">Hash+LL</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Set</code></td>
<td class="org-left">HashSet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TreeSet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LinkedHashSet</td>
</tr>

<tr>
<td class="org-left"><code>List</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ArrayList</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Linked List</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Deque</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ArrayDeque</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Linked List</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>Map</code></td>
<td class="org-left">HashMap</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TreeMap</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">LinkedHashMap</td>
</tr>
</tbody>
</table>

<div id="outline-container-org767ebd6" class="outline-2">
<h2 id="org767ebd6"><span class="section-number-2">1</span> Slides</h2>
<div class="outline-text-2" id="text-1">
<iframe src="https://docs.google.com/presentation/d/e/2PACX-1vQsIhSI1GokuxUKAuOIFCngTOXWEdr4b-ByWJxI-z0xR7iV2kiGOmAMJNLFdSOUcFV0sHTkBuqhyOFN/embed?start=false&loop=false&delayms=3000" frameborder="0" width="480" height="389" allowfullscreen="true" mozallowfullscreen="true" webkitallowfullscreen="true"></iframe>
</div>
</div>

<div id="outline-container-orgf5a40e6" class="outline-2">
<h2 id="orgf5a40e6"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The Java Collections Framework <a href="https://docs.oracle.com/javase/8/docs/technotes/guides/collections/">https://docs.oracle.com/javase/8/docs/technotes/guides/collections/</a></li>
<li>The Java Tutorials: Collections
<a href="https://docs.oracle.com/javase/tutorial/collections/index.html">https://docs.oracle.com/javase/tutorial/collections/index.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:17</p>
</div>
</body>
</html>
